#ifndef __container__
#define __container__

//------------------------------------------------------------------------------
// container.h - содержит тип данных,
// представляющий простейший контейнер
//------------------------------------------------------------------------------

#include "number.h"
class Container {
public:
    Container();
    ~Container();

    // Ввод содержимого контейнера из указанного потока
    void In(FILE& ifst);
    // Случайный ввод содержимого контейнера
    void InRnd(int size);
    // Вывод содержимого контейнера в указанный поток
    void Out(FILE& ofst);
    // Вычисление суммы приведенных к действительному числу всех чисел в контейнере
    double RealAverage();
    // Удаление элементов контейнера, действительное значение которых меньше среднего
    void DeleteLowerThanAverage();
    void Clear();    // Очистка контейнера от данных
private:
    int len; // текущая длина
    Number* storage[10000];
};

#endif
