#ifndef __fraction__
#define __fraction__

//------------------------------------------------------------------------------
// fraction.h - содержит описание простой дроби
//------------------------------------------------------------------------------

#include "stdio.h"
#include "rnd.h"
#include "number.h"

//------------------------------------------------------------------------------
// простая дробь
class Fraction:public Number{
public:
    virtual ~Fraction() {}
    // Ввод параметров простой дроби из файла
    virtual void In(FILE& ifst);
    // Случайный ввод параметров простой дроби
    virtual void InRnd();
    // Вывод параметров простой дроби в форматируемый поток
    virtual void Out(FILE& ofst);
    // Вычисление вещественной части простой дроби
    virtual double Real();
private:
    int a, b; // числитель и знаменатель
};


#endif //__fraction__
