//------------------------------------------------------------------------------
// fraction.cpp - содержит функции обработки простой дроби
//------------------------------------------------------------------------------

#include "fraction.h"

//------------------------------------------------------------------------------
// Ввод параметров простой дроби из потока
void Fraction::In(FILE &ifst) {
    fscanf(&ifst, "%d%d", a, b);
    if (b == 0) {
        printf("%s", "Incorrect input values.\nDenominator must not be zero");
        exit(0);
    }
}

// Случайный ввод параметров простой дроби
void Fraction::InRnd() {
    a = Number::rnd20.Get();
    do {
        b = Number::rnd20.Get();
    } while(b==0);
}

//------------------------------------------------------------------------------
// Вывод параметров простой дроби в поток
void Fraction::Out(FILE &ofst) {
    fprintf(&ofst, "%s%d%s%d%s%g%s", "It is Fraction: a = "
        , a, ", b = ", b
        , ". Real = ", Real(), "\n");
}

//------------------------------------------------------------------------------
// Приведение простой дроби к действительномму числу
double Fraction::Real() {
    return double(a) / b ;
}
